Autodesk.Revit.DB.AdvancedGeolocationLinkInfo.ConvertLinkInfo(Autodesk.Revit.DB.ForgeTypeId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Double,System.Double)
Creates and returns an AdvancedGeolocationLinkInfo with the converted data.
linkUnit:
Unit of the link file.
localReferencePoint:
localReference point for the Advanced Geolocation, in the specified unit.
referencePoint:
referencePoint for the advanced Geolocation, in the specified unit.
rotation:
rotation for the advanced Geolocation, in degrees.
combinedScaleFactor:
combined scale factor for the geolocation, as unit-less factor
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.AdvancedGeolocationLinkInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.AdvancedGeolocationLinkInfo.CombinedScaleFactor
combined scale factor.

Autodesk.Revit.DB.AdvancedGeolocationLinkInfo.Rotation
rotation stored as Revit Internal Units

Autodesk.Revit.DB.AdvancedGeolocationLinkInfo.ReferencePoint
referencePoint stored as Revit Internal Units.

Autodesk.Revit.DB.AdvancedGeolocationLinkInfo.LocalReferencePoint
localReferencePoint stored as Revit Internal Units.

Autodesk.Revit.DB.AdvancedGeolocationLinkInfo
Collection of data required to create an Advanced Geolocation from a linked file.
Remarks:
The data stored here is in Revit internal units, required for creation of advanced geolocation.
NOTE (REVIT-252075): this class is intentionally retained even though it currently has no
callers. Acquiring geolocation from a DWG was changed to a CRS-only advanced geolocation
because the DWG-derived parameters could not be parsed reliably. Once RealDWG can extract
all required parameters (expected ~2028), we plan to reintroduce a fully-defined advanced
geolocation built from this data (or something very similar). Do not delete without checking
that future work.